Repository: hasanur-rahman079/s3ojs
Catalog: locale/*/locale.po
Languages: vi

# plugins.generic.s3Storage.displayName
source: S3 Storage Plugin
vi: Plugin Lưu trữ S3

# plugins.generic.s3Storage.description
source: This plugin integrates S3-compatible storage for file management in OJS, supporting AWS S3, Wasabi, DigitalOcean Spaces and more, providing scalable and reliable cloud storage solution with hybrid mode and fallback mechanisms.
vi: Plugin này tích hợp lưu trữ tương thích S3 để quản lý tệp tin trong OJS, hỗ trợ AWS S3, Wasabi, DigitalOcean Spaces và nhiều dịch vụ khác, cung cấp giải pháp lưu trữ đám mây có thể mở rộng với chế độ lai và cơ chế dự phòng.

# plugins.generic.s3Storage.settings.title
source: S3 Storage Settings
vi: Cài đặt Lưu trữ S3

# plugins.generic.s3Storage.settings.description
source: Configure S3-compatible storage settings for file management. Supports AWS S3, Wasabi, DigitalOcean Spaces and other S3-compatible services.
vi: Cấu hình cài đặt lưu trữ tương thích S3 để quản lý tệp tin. Hỗ trợ AWS S3, Wasabi, DigitalOcean Spaces và các dịch vụ tương thích S3 khác.

# plugins.generic.s3Storage.settings.provider
source: Storage Provider
vi: Nhà cung cấp Lưu trữ

# plugins.generic.s3Storage.settings.provider.description
source: Select your S3-compatible storage provider.
vi: Chọn nhà cung cấp lưu trữ tương thích S3 của bạn.

# plugins.generic.s3Storage.settings.customEndpoint
source: Custom Endpoint (Optional)
vi: Endpoint Tùy chỉnh (Tùy chọn)

# plugins.generic.s3Storage.settings.customEndpoint.description
source: Custom S3 endpoint URL for non-AWS providers (e.g., https://s3.wasabisys.com for Wasabi).
vi: URL endpoint S3 tùy chỉnh cho các nhà cung cấp không phải AWS (vd: https://s3.wasabisys.com cho Wasabi).

# plugins.generic.s3Storage.settings.bucket
source: S3 Bucket Name
vi: Tên Bucket S3

# plugins.generic.s3Storage.settings.bucket.description
source: The name of your S3-compatible bucket where files will be stored.
vi: Tên của bucket tương thích S3 nơi các tệp tin sẽ được lưu trữ.

# plugins.generic.s3Storage.settings.bucket.required
source: S3 bucket name is required.
vi: Tên bucket S3 là bắt buộc.

# plugins.generic.s3Storage.settings.key.description
source: Your Access Key ID with permission to access the storage bucket.
vi: Access Key ID của bạn có quyền truy cập bucket lưu trữ.

# plugins.generic.s3Storage.settings.key.required
source: Access Key ID is required.
vi: Access Key ID là bắt buộc.

# plugins.generic.s3Storage.settings.secret.description
source: Your Secret Access Key corresponding to the Access Key ID.
vi: Secret Access Key tương ứng với Access Key ID.

# plugins.generic.s3Storage.settings.secret.required
source: Secret Access Key is required.
vi: Secret Access Key là bắt buộc.

# plugins.generic.s3Storage.settings.region
source: Region
vi: Khu vực

# plugins.generic.s3Storage.settings.region.description
source: The region where your storage bucket is located.
vi: Khu vực nơi bucket lưu trữ của bạn được đặt.

# plugins.generic.s3Storage.settings.region.required
source: Region is required.
vi: Khu vực là bắt buộc.

# plugins.generic.s3Storage.settings.hybridMode
source: Enable Hybrid Mode
vi: Bật Chế độ Lai

# plugins.generic.s3Storage.settings.hybridMode.description
source: Keep files stored both locally and on cloud storage for redundancy.
vi: Lưu trữ tệp tin cả ở local và cloud để dự phòng.

# plugins.generic.s3Storage.settings.fallbackEnabled
source: Enable Fallback Mechanism
vi: Bật Cơ chế Dự phòng

# plugins.generic.s3Storage.settings.fallbackEnabled.description
source: Use local storage when cloud storage is unavailable.
vi: Sử dụng lưu trữ local khi lưu trữ đám mây không khả dụng.

# plugins.generic.s3Storage.settings.autoSync
source: Enable Auto Sync
vi: Bật Đồng bộ Tự động

# plugins.generic.s3Storage.settings.autoSync.description
source: Automatically sync OJS files to the configured storage bucket.
vi: Tự động đồng bộ các tệp tin OJS tới bucket lưu trữ đã cấu hình.

# plugins.generic.s3Storage.settings.cronEnabled
source: Enable Cron Jobs
vi: Bật Cron Jobs

# plugins.generic.s3Storage.settings.cronEnabled.description
source: Enable scheduled tasks for maintenance and cleanup.
vi: Bật các tác vụ được lên lịch để bảo trì và dọn dẹp.

# plugins.generic.s3Storage.settings.cronFrequency
source: Cron Job Frequency
vi: Tần suất Cron Job

# plugins.generic.s3Storage.settings.cronFrequency.description
source: How often to run maintenance tasks.
vi: Tần suất chạy các tác vụ bảo trì.

# plugins.generic.s3Storage.settings.cleanupOrphaned
source: Auto-cleanup Orphaned Files
vi: Tự động Dọn dẹp Files Mồ côi

# plugins.generic.s3Storage.settings.cleanupOrphaned.description
source: Automatically delete unused or orphaned files from storage.
vi: Tự động xóa các tệp tin không sử dụng hoặc mồ côi khỏi lưu trữ.

# plugins.generic.s3Storage.settings.connectionTest.failed
source: Failed to connect to storage service. Please verify your credentials and configuration.
vi: Không thể kết nối đến dịch vụ lưu trữ. Vui lòng xác minh thông tin đăng nhập và cấu hình của bạn.

# plugins.generic.s3Storage.settings.connectionTest.success
source: Successfully connected to storage service.
vi: Kết nối thành công đến dịch vụ lưu trữ.

# plugins.generic.s3Storage.sync.title
source: Media Library Sync
vi: Đồng bộ Thư viện Media

# plugins.generic.s3Storage.sync.description
source: Sync existing OJS files to the configured storage bucket.
vi: Đồng bộ các tệp tin OJS hiện có tới bucket lưu trữ đã cấu hình.

# plugins.generic.s3Storage.sync.start
source: Start Sync
vi: Bắt đầu Đồng bộ

# plugins.generic.s3Storage.sync.inProgress
source: Sync in progress...
vi: Đang đồng bộ...

# plugins.generic.s3Storage.sync.completed
source: Sync completed successfully.
vi: Đồng bộ hoàn thành thành công.

# plugins.generic.s3Storage.sync.failed
source: Sync failed. Please check the error logs.
vi: Đồng bộ thất bại. Vui lòng kiểm tra nhật ký lỗi.

# plugins.generic.s3Storage.cleanup.title
source: Storage Cleanup
vi: Dọn dẹp Lưu trữ

# plugins.generic.s3Storage.cleanup.description
source: Remove orphaned and unused files from storage.
vi: Xóa các tệp tin mồ côi và không sử dụng khỏi lưu trữ.

# plugins.generic.s3Storage.cleanup.start
source: Start Cleanup
vi: Bắt đầu Dọn dẹp

# plugins.generic.s3Storage.cleanup.inProgress
source: Cleanup in progress...
vi: Đang dọn dẹp...

# plugins.generic.s3Storage.cleanup.completed
source: Cleanup completed successfully.
vi: Dọn dẹp hoàn thành thành công.

# plugins.generic.s3Storage.cleanup.failed
source: Cleanup failed. Please check the error logs.
vi: Dọn dẹp thất bại. Vui lòng kiểm tra nhật ký lỗi.

# plugins.generic.s3Storage.cron.title
source: Scheduled Tasks
vi: Tác vụ Lên lịch

# plugins.generic.s3Storage.cron.description
source: Configure automated maintenance tasks.
vi: Cấu hình các tác vụ bảo trì tự động.

# plugins.generic.s3Storage.cron.frequency.hourly
source: Hourly
vi: Hàng giờ

# plugins.generic.s3Storage.cron.frequency.daily
source: Daily
vi: Hàng ngày

# plugins.generic.s3Storage.cron.frequency.weekly
source: Weekly
vi: Hàng tuần

# plugins.generic.s3Storage.cron.frequency.monthly
source: Monthly
vi: Hàng tháng

# plugins.generic.s3Storage.error.hybridFailed
source: Hybrid mode operation failed. Falling back to single storage mode.
vi: Thao tác chế độ lai thất bại. Chuyển về chế độ lưu trữ đơn.

# plugins.generic.s3Storage.error.fallbackActivated
source: Storage service unavailable. Fallback to local storage activated.
vi: Dịch vụ lưu trữ không khả dụng. Kích hoạt dự phòng sang lưu trữ local.

# plugins.generic.s3Storage.error.uploadFailed
source: Failed to upload file to storage service.
vi: Không thể tải tệp tin lên dịch vụ lưu trữ.

# plugins.generic.s3Storage.error.deleteFailed
source: Failed to delete file from storage service.
vi: Không thể xóa tệp tin khỏi dịch vụ lưu trữ.

# plugins.generic.s3Storage.error.downloadFailed
source: Failed to download file from storage service.
vi: Không thể tải tệp tin từ dịch vụ lưu trữ.

# plugins.generic.s3Storage.error.fileNotFound
source: File not found in storage service.
vi: Không tìm thấy tệp tin trong dịch vụ lưu trữ.

# plugins.generic.s3Storage.error.bucketNotFound
source: Storage bucket not found or not accessible.
vi: Không tìm thấy bucket lưu trữ hoặc không thể truy cập.

# plugins.generic.s3Storage.error.permissionDenied
source: Permission denied. Please check your credentials and bucket policies.
vi: Quyền bị từ chối. Vui lòng kiểm tra thông tin đăng nhập và chính sách bucket của bạn.

# plugins.generic.s3Storage.provider.custom
source: Custom S3-Compatible Service
vi: Dịch vụ Tương thích S3 Tùy chỉnh
